#include "inputCheck.h" // Підключення заголовочного файлу, що потрібен для реаліазції функцій валідації вводу

int inputInt(double min, double max) // Визначення функції для валідації користувацького вводу цілих чисел
{
    if (min > max) // Логічна помилка, якщо мінімальне значення більше за максимальне
    {
        std::cerr << "\n[СИСТЕМНА ПОМИЛКА] - Аргументи діапазону задані неправильно!\n";
        exit(1); // Вихід з програми
    }
    std::string input;
    size_t pos;
    int number;
    while (true) // Цикл для повторного запиту вводу, поки користувач не введе коректне значення
    {
        std::getline(std::cin, input);
        try
        {
            try
            {
                number = std::stoi(input, &pos); // Спроба конвертувати рядок у ціле число
            }
            // Обробка можливих помилок конвертації
            catch (const std::invalid_argument& e)
            {
                throw std::invalid_argument("\n[ПОМИЛКА] - Введено некоректний запис!\nСпробуйте ввести ще раз: ");
            }
            catch (const std::out_of_range& e)
            {
                throw std::out_of_range("\n[ПОМИЛКА] - Введений числовий запис виходить за межі допустимого!\nСпробуйте ввести ще раз: ");
            }
            if (pos < input.length()) // Перевірка на наявність зайвих символів після числа
            {
                throw std::invalid_argument("\n[ПОМИЛКА] - У записі наявні зайві символи!\nСпробуйте ввести ще раз: ");
            }
            if (number <= max && number >= min) // Перевірка, чи знаходиться число в межах допустимого діапазону
            {
                return number; // Повернення int значення
            }
            else
            {
                std::cout << "\n[ПОМИЛКА] - Введений числовий запис виходить за межі допустимого!\nСпробуйте ввести ще раз: ";
                continue; // Якщо число не в межах, повторити запит вводу
            }
        }
        catch (const std::invalid_argument& e) // Перехоплення помилки некоректного запису
        {
            std::cerr << e.what();
            continue;
        }
        catch (const std::out_of_range& e) // Перехоплення помилки виходу за межі допустимого діапазону
        {
            std::cerr << e.what();
            continue;
        }
    }
}

double inputDouble(double min, double max) // Визначення функції для валідації користувацького вводу чисел з плавуючою крапкою
{
    if (min > max) // Логічна помилка, якщо мінімальне значення більше за максимальне
    {
        std::cerr << "\n[СИСТЕМНА ПОМИЛКА] - Аргументи діапазону задані неправильно!\n";
        exit(1); // Вихід з програми
    }
    std::string input;
    size_t pos;
    double number;

    while (true)
    {
        std::getline(std::cin, input);
        try
        {
            try
            {
                number = std::stod(input, &pos); // Спроба конвертувати рядок у число типу double
            }
            // Обробка можливих помилок конвертації
            catch (const std::invalid_argument& e)
            {
                throw std::invalid_argument("\n[ПОМИЛКА] - Введено некоректний запис!\nСпробуйте ввести ще раз: ");
            }
            catch (const std::out_of_range& e)
            {
                throw std::out_of_range("\n[ПОМИЛКА] - Введений числовий запис виходить за межі допустимого!\nСпробуйте ввести ще раз: ");
            }

            if (pos < input.length()) // Перевірка на наявність зайвих символів після числа
            {
                throw std::invalid_argument("\n[ПОМИЛКА] - У записі наявні зайві символи!\nСпробуйте ввести ще раз: ");
            }
            if (number < min || number > max) // Перевірка, чи знаходиться число в межах допустимого діапазону
            {
                std::cerr << "\n[ПОМИЛКА] - Введений числовий запис виходить за межі допустимого!\nСпробуйте ввести ще раз: ";
                continue;
            }

            return number; // Повернення double значення
        }
        catch (const std::invalid_argument& e) // Перехоплення помилки некоректного запису
        {
            std::cerr << e.what();
            continue;
        }
        catch (const std::out_of_range& e) // Перехоплення помилки виходу за межі діапазону
        {
            std::cerr << "\n[ПОМИЛКА] - Число занадто велике для обробки!\nСпробуйте ввести ще раз: ";
            continue;
        }
    }
}