// calculate_array.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#include <iostream> // Для вводу/виводу
#include <Windows.h> // Для коректного відображення символів кирилиці
#define SIZE 100 // Статичний розмір масиву

int main() // Головна функція програми
{
    SetConsoleOutputCP(65001); // Налаштування кодування UTF-8
    SetConsoleCP(65001); // Налаштування кодування UTF-8

    int array[SIZE]; // Оголошення масиву розміром SIZE
    // Оголошення та ініціалізація змінних типу int
    int N, avg, count = 0;
    int sum = 0;
    int sum_avg = 0;

    std::cout << "Введіть число N: ";
    std::cin >> N; // Введення числа з клавіатури
    while (N <= 0 || N > SIZE) // Якщо користувач неправильно ввів число
    {
        std::cout << "[УВАГА] - Кількість елементів в масиві "
            "має бути > 0 та <= " << SIZE << "!" << std::endl;
        std::cout << "Введіть число N: ";
        std::cin >> N; // Повторне введення числа
    }
    for (int i = 0; i < N; i++) // Цикл по елементам масиву
    {
        std::cout << "Введіть значення елементу масива array[" << i << 
            "]: ";
        std::cin >> array[i]; // Введення значення з клавіатури
    }
    for (int i = 0; i < N; i++) // Цикл по кожному елементу масиву
    {
        if (array[i] % 2 == 0) // Якщо число парне
        {
            sum += array[i]; // Додавання значення до загальної суми
        }
        else // Інакше
        {
            sum_avg += array[i]; // Рахунок суми непарних чисел
            count++; // Кількість непарних чисел
        }
    }
    if (count == 0) // Якщо в масиві відсутні непарні елементи
    {
        avg = 0;
        std::cout << "\nРезультати:\nСума парних елементів в масиві "
            "array[" << N << "]: " << sum << "\n\nСереднє арифметичне "
            "непарних елементів в масиві array[" << N << "]: [УВАГА] " 
            "Неможливо порахувати, адже в масиві відсутні "
            "непарні елементи!"; 
    }
    else // Якщо є непарні
    {
        avg = sum_avg / count; // Розрахунок середнього арифметичного

        // Виведення результатів на екран консолі
        std::cout << "\nРезультати:\nСума парних елементів в масиві array[" <<
            N << "]: " << sum << "\n\nСереднє арифметичне непарних елементів"
            " в масиві array[" << N << "]: " << avg << std::endl;
    }
}

